{"title":"My Journey writing an Article Title","authors":["Author Name",""],"editors":[""],"collaborators":[],"summary":"## This is a sample Journey which details how to write an article on [this website](#)\n### In these text boxes you can use [Markdown](https://www.markdownguide.org/basic-syntax) in order to make you article look nicer\n### It resizes automatically so you don't have to worry about anything, and in the following pages I will give a rundown \n### of the markdown syntax, aswell as how to use this interface, so you can write your own article\n<br/>\n###### Feel free to do research on your own if you wan't to learn markdown well since it's a really usefull skill\n","description":"## This is a Title Card. It will appear on the home page so people can visit this Journey.\n\n**Here you can use markdown (aswell as in any other textbox)**.\n\nBe wary, in preview mode, and on the home page, this whole box is a link.","pages":[{"title":"How to structure a Journey","description":"## This page details the general guidelines on how to structure your Journey (article). \n<br>\n### These aren't enforced in any way so feel free to take as much, or as little creative licence as you want.","summary":"## The following sections will go over the main components of the Journey.\n  1. The Front Page\n  2. The Page Previews\n  3. The Pages\n  4. The Sections","sections":[{"title":"The Frontpage","content":"The frontpage is the entrance point in a Journey.\n\nIt is composed of multiple parts:\n<br/><br/>\nThe first one I call the \"Journey Preview\".\n\nHere you can find the journey title, authors, editors and a description of it's contents.\n<br/><br/>\nAfter that you have the page previews (one for each page) which are detailed in the next section.\n<br/><br/>\nOne thing to keep in mind is that there is a difference between authors and editors.\n\nAuthors are the ones which actually went through the Journey, while Editors only helped write the contents of the article.\n<br/><br/>\nHere you can also edit the Journey Titlecard which will appear on the home page. \n\nThis is only visible in edit mode.\n\nThis should contain a description of the Journey's content. \n\nBe wary that this will stretch to whole screen no matter what. \n\nAlso I don't recommend making it too long (vertically)."},{"title":"The Page Previews","content":"The page previews contain a title and a description which should tell the user what to expect on that page.\n\nThese are supposed to present what to expect from a page. There isn't much I have to say about these, \n\nso I'll leave this section as is."},{"title":"The Pages","content":"The pages are composed multiple sections. The first of these contains the page title followed by a summary of it's\n\ncontents. This is very similar to the page previews described above but should contain a closer look at what the \n\npage has to offer .\n\nAfter that there will be multple sections which are supposed to contain the majority of the informational content.\n\nThese will be detailed in the next section."},{"title":"The Sections","content":"The sections are where you should write out the contents of you journey. In case you don't know what you should\n\nor where to start feel free to look at other journeys in order to get a feel for things. \n\nSections can vary in size but, generally they shouldn't be bigger than the height of you screen, in order to be able to \n\nread the whole section without scrolling to much."},{"title":"Final Details","content":"I can't stress enough that if you have an idea you shoudn't let these guidelines interfere with it. \n\nOther than that if you have any questions or feature requests don't hesitate to contact me at stefan.piscu@gmail.com.\n\nI'll try my best to answer all questions, or implement any \"light\" features requested by you."}]},{"title":"Basic Markdown Syntax","description":"## This page contains basic markdown syntax. \n<br><br>\n### This is probably enough for most sections, altough if you want to do something that's not covered in \n### this page I highly recommend [this website](https://www.markdownguide.org/basic-syntax)","summary":"This page goes through the basic markdown syntax which you can utilise to write a Journey,\n\nI you can use the preview button in order to render the markdown,","sections":[{"title":"Line Breaks and Formatting","content":"Everything that is written on adjacent lines will be put in the same line. \nLike this\n\nIn order to write in multiple lines you have to add an empty line in the markdown.<br>\nAlternatively you can use line breaks. If you need multplie lines between text you<br><br>\nYou have to use them.\nYou can also use _, and * in order to format text: (view in edit mode)\n- **bold** __bold__\n- *italic* _italic_ \n- __*bolditalic*__ ___bolditalic___ ***bolditalic*** etc,\n- You can use backslash \"\\\" to avoid formatting \\*bold\\*\n- You can also use html tags (if you are familiar) for example:<sup>test</sup>\n<br><br>\nAbove this is a list;\n1. You can also have a number list\n2. This is just an item\n<br>\n```\nYou can also prite text blocks by using ```, no formatting can happen here and the font is \nmonospace, perfect for code snippets, other text that might be ruined by pasteing it into \nmarkdown\n```\n    You can also achieve this by indenting a line with 4 spaces\n`You can also just write in monospace without having to create a text block using `  `"},{"title":"Headers and links","content":"You can use on or more #, followed by a space in order to mark a line of text as a header.\n\nThis is useful for manipulating text size\n# BIGEST\n## BIGGER\n### BIG\n#### BIGish\nNormal\n##### small\n###### smallest\na\nYou can also add links [name](pathname), they can be relative [like this](journey/SampleArticle/1/edit) \nor lead to other pages completly [Google](https://google.com).<br>"},{"title":"Images and html","content":"You can use html inside markdown if you are familiar with it (although it's rarely necessary to do anything<br>\ncomplex).\n<br><br>\nOne example might be images. In order to import an image you can use the img tag like this<br>\n```\n<img src=\"source\" width=\"width in pixels\" height=\"height in pixels\" />\nYou can also not include width and height and they will be automatically deduced.\nEven so including a width is recommended.\n```\n<img src=\"https://picsum.photos/400/100\" width=\"200\" height=\"50\" /><br>\n<img src=\"https://picsum.photos/400/100\" width=\"200\" /><br>\n<img src=\"https://picsum.photos/400/100\" height=\"50\" /><br>\n<img src=\"https://picsum.photos/400/100\" /><br>\nIf you want to include an image but haven't found one yet you can use [Picsum](https://picsum.photos) as a placeholder\n\nUnfortunately uploading images is not yet a feature so you will have to use an online source.\n\nIf you have an image (not found online) and want to use it in you journey feel free to email me (\"at stefan.piscu@gmail.com\") \n\nand I'll try to put it in the assets folder of the website so you can use it.\n\n"},{"title":"General Tips","content":"There are more advanced things you can do in markdown and I highly reccmoend learning it since it can be a really useful<br>\nin plenty of scenarious. If you have any questions you can use any search engine since markdown is a very popular language<br>\n<br>\nIf you are an editor you can also view the markdown of other Journeys which you can then use as inspiration."}]},{"title":"Other Topics","description":"## This page contains topics that I haven't covered in the previous 2 pages","summary":"Here you will find details about the journey writing systems that I couldn't fit under in the <br>\nother pages or that I find sligtly more advanced.","sections":[{"title":"Collaborators","content":"If you are reading this you probably are an editor. An editor account can edit any Journey, however<br>\nonly the Admin (me), can make new editors. However in many cases someone might only need to <br>\nwrite in a single article so giving them an editor account would't be neccesary.<br>\nThat's why you can freely add or remove collaborators, just add their username in the input box next to<br>\nthe save button and they will be able to edit the Journey.\n<br><br>\nIn the event you are a collaborator **do not delete your name**. You will be unable to add it back. \n<br><br>\nEssentially collaborators can only edit the Journeys where they have been added."},{"title":"Commiting and Saving","content":"The website has a draft system. Most of the time You will not be able to make all the changes you wish at the<br>\nsame time. That's why there is a distinction between saving and committing. \n<br><br>\nSaving a Journey will only save it as a draft (which will be accesed in edit mode). This way you can make some<br>\nchanges and save them for later without affecting the actual Journey.\n<br><br>\nCommiting a Journey also updates the view of the Journey allowing it to be seen from the home page.<br> Think of it as\ncommiting to the changes."}]}],"id":"sample_article"}